In [120]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [121]:
clientes_data = {
    'cliente_id': [1, 2, 3, 4, 5, 6, 7],
    'nombre': ['Ana García', 'Luis Martínez', 'Carlos Rodríguez', 'María López', 
               'Pedro Sánchez', 'Laura Fernández', 'Sofia Ramirez'],
    'email': ['ana@gmail.com', 'luis@empresa.com', 'carlos@hotmail.com', 
              'maria@gmail.com', 'pedro@yahoo.com', 'laura@gmail.com', 'sofia@empresa.com'],
    'ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Barcelona', 'Bilbao'],
    'saldo': ['1500.50', '800.75', '2200.00', '950.25', '3000.80', '1200.40', '750.90'],
    'fecha_registro': ['2023-01-15', '2022-03-22', '2023-05-10', '2021-11-30', 
                       '2023-08-14', '2022-01-05', '2023-12-01'],
    'categoria': ['Premium', 'Standard', 'Premium', 'Standard', 'Premium', 'Standard', 'Standard']
}


pedidos_data = {
    'pedido_id': [101, 102, 103, 104, 105, 106, 107, 108, 109],
    'cliente_id': [1, 2, 1, 3, 4, 2, 1, 8, 3],  # cliente_id 8 no existe en clientes
    'producto': ['Laptop', 'Tablet', 'Smartphone', 'Monitor', 'Teclado', 
                 'Mouse', 'Tablet', 'Monitor', 'Laptop'],
    'cantidad': [1, 2, 1, 1, 3, 2, 1, 1, 1],
    'precio': [800, 300, 500, 250, 50, 25, 300, 250, 800],
    'fecha_pedido': ['2023-02-20', '2023-03-15', '2023-04-10', '2023-05-25', 
                     '2023-06-05', '2023-07-18', '2023-08-20', '2023-09-01', '2023-10-15'],
    'estado': ['Entregado', 'Entregado', 'Pendiente', 'Entregado', 'Cancelado', 
               'Entregado', 'Entregado', 'Pendiente', 'Pendiente']
}


productos_data = {
    'producto_id': ['P001', 'P002', 'P003', 'P004', 'P005'],
    'nombre': ['Laptop', 'Tablet', 'Smartphone', 'Monitor', 'Teclado'],
    'precio': ['1200.75', '450.50', '799.99', '299.00', '89.95'],
    'categoria': ['Tecnología', 'Tecnología', 'Tecnología', 'Oficina', 'Oficina'],
    'stock': [15, 30, 25, 40, 100]
}

df_clientes = pd.DataFrame(clientes_data).set_index("cliente_id")
df_pedidos = pd.DataFrame(pedidos_data).set_index("pedido_id")
df_productos = pd.DataFrame(productos_data).set_index("producto_id")

df_clientes['saldo'] = pd.to_numeric(df_clientes['saldo'])
df_clientes['fecha_registro'] = pd.to_datetime(df_clientes['fecha_registro'])
df_pedidos['fecha_pedido'] = pd.to_datetime(df_pedidos['fecha_pedido'])
df_productos['precio'] = pd.to_numeric(df_productos['precio'])

In [122]:
df_clientes

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.50,2023-01-15,Premium
2,Luis Martínez,luis@empresa.com,Barcelona,800.75,2022-03-22,Standard
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.00,2023-05-10,Premium
4,María López,maria@gmail.com,Valencia,950.25,2021-11-30,Standard
5,Pedro Sánchez,pedro@yahoo.com,Sevilla,3000.80,2023-08-14,Premium
6,Laura Fernández,laura@gmail.com,Barcelona,1200.40,2022-01-05,Standard
7,Sofia Ramirez,sofia@empresa.com,Bilbao,750.90,2023-12-01,Standard

In [123]:
df_pedidos["total"] = df_pedidos.cantidad * df_pedidos.precio
df_pedidos

,cliente_id,producto,cantidad,precio,fecha_pedido,estado,total
pedido_id,,,,,,,
101,1,Laptop,1,800,2023-02-20,Entregado,800
102,2,Tablet,2,300,2023-03-15,Entregado,600
103,1,Smartphone,1,500,2023-04-10,Pendiente,500
104,3,Monitor,1,250,2023-05-25,Entregado,250
105,4,Teclado,3,50,2023-06-05,Cancelado,150
106,2,Mouse,2,25,2023-07-18,Entregado,50
107,1,Tablet,1,300,2023-08-20,Entregado,300
108,8,Monitor,1,250,2023-09-01,Pendiente,250
109,3,Laptop,1,800,2023-10-15,Pendiente,800

In [124]:
df_productos

                 nombre   precio   categoria  stock
producto_id
P001             Laptop  1200.75  Tecnología     15
P002             Tablet   450.50  Tecnología     30
P003         Smartphone   799.99  Tecnología     25
P004            Monitor   299.00     Oficina     40
P005            Teclado    89.95     Oficina    100

In [125]:
# 1.   SELECT nombre, ciudad FROM clientes

df_clientes[["nombre", "ciudad"]]

                      nombre     ciudad
cliente_id
1                 Ana García     Madrid
2              Luis Martínez  Barcelona
3           Carlos Rodríguez     Madrid
4                María López   Valencia
5              Pedro Sánchez    Sevilla
6            Laura Fernández  Barcelona
7              Sofia Ramirez     Bilbao

In [126]:
# 2. SELECT * FROM clientes WHERE ciudad = 'Madrid'

df_clientes.query("ciudad == 'Madrid'")

df_clientes[df_clientes["ciudad"] == "Madrid"]

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.5,2023-01-15,Premium
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.0,2023-05-10,Premium

In [127]:
# 3. SELECT * FROM clientes WHERE ciudad = 'Madrid' AND categoria = 'Premium'

df_clientes.query("ciudad == 'Madrid' and categoria == 'Premium'")

df_clientes[(df_clientes["ciudad"] == 'Madrid') & (df_clientes["categoria"] == 'Premium')]

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.5,2023-01-15,Premium
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.0,2023-05-10,Premium

In [128]:
# 4.  SELECT * FROM clientes WHERE ciudad = 'Madrid' OR ciudad = 'Barcelona'

df_clientes.query("ciudad == 'Madrid' or ciudad == 'Barcelona'")

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.50,2023-01-15,Premium
2,Luis Martínez,luis@empresa.com,Barcelona,800.75,2022-03-22,Standard
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.00,2023-05-10,Premium
6,Laura Fernández,laura@gmail.com,Barcelona,1200.40,2022-01-05,Standard

In [129]:
# 5. SELECT nombre, ciudad FROM clientes ORDER BY ciudad DESC, nombre ASC

df_clientes[["nombre", "ciudad"]].sort_values(by=["ciudad", "nombre"], ascending=[False, True])

                      nombre     ciudad
cliente_id
4                María López   Valencia
5              Pedro Sánchez    Sevilla
1                 Ana García     Madrid
3           Carlos Rodríguez     Madrid
7              Sofia Ramirez     Bilbao
6            Laura Fernández  Barcelona
2              Luis Martínez  Barcelona

In [130]:
# 6. SELECT * FROM clientes LIMIT 3

df_clientes.head(3)

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.50,2023-01-15,Premium
2,Luis Martínez,luis@empresa.com,Barcelona,800.75,2022-03-22,Standard
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.00,2023-05-10,Premium

In [131]:
# 7. SELECT COUNT(*) FROM clientes

len(df_clientes)
df_clientes.shape[0]

7

In [132]:
# 8. SELECT ciudad, COUNT(*) FROM clientes GROUP BY ciudad

df_clientes.groupby("ciudad").size()

ciudad
Barcelona    2
Bilbao       1
Madrid       2
Sevilla      1
Valencia     1
dtype: int64

In [133]:
# 9.  SELECT cliente_id, COUNT(*), SUM(total), AVG(total) FROM pedidos GROUP BY cliente_id

df_pedidos.groupby("cliente_id").agg(
    total_pedidos=("cliente_id", "count"),
    suma_total=("total", "sum"),
    media_total=("total", "mean")    
)

            total_pedidos  suma_total  media_total
cliente_id
1                       3        1600   533.333333
2                       2         650   325.000000
3                       2        1050   525.000000
4                       1         150   150.000000
8                       1         250   250.000000

In [134]:
# 10. SELECT ciudad, COUNT(*) as cnt FROM clientes GROUP BY ciudad HAVING cnt > 1

grouped_ciudad = df_clientes.groupby("ciudad").agg(
    cnt=("nombre", "count")
)
grouped_ciudad[grouped_ciudad["cnt"] > 1]

           cnt
ciudad
Barcelona    2
Madrid       2

In [135]:
# 11. SELECT c.nombre, p.producto, p.total FROM clientes c JOIN pedidos p ON c.cliente_id = p.cliente_id

pd.merge(df_clientes, df_pedidos, on="cliente_id")[["nombre", "producto", "total"]]

             nombre    producto  total
0        Ana García      Laptop    800
1        Ana García  Smartphone    500
2        Ana García      Tablet    300
3     Luis Martínez      Tablet    600
4     Luis Martínez       Mouse     50
5  Carlos Rodríguez     Monitor    250
6  Carlos Rodríguez      Laptop    800
7       María López     Teclado    150

In [136]:
# 12. SELECT c.nombre, p.producto FROM clientes c LEFT JOIN pedidos p ON c.cliente_id = p.cliente_id

pd.merge(df_clientes, df_pedidos, how="left", on="cliente_id")[["nombre", "producto"]]

              nombre    producto
0         Ana García      Laptop
1         Ana García  Smartphone
2         Ana García      Tablet
3      Luis Martínez      Tablet
4      Luis Martínez       Mouse
5   Carlos Rodríguez     Monitor
6   Carlos Rodríguez      Laptop
7        María López     Teclado
8      Pedro Sánchez         NaN
9    Laura Fernández         NaN
10     Sofia Ramirez         NaN

In [137]:
# 13.  SELECT c.nombre, p.pedido_id FROM clientes c RIGHT JOIN pedidos p ON c.cliente_id = p.cliente_id

pd.merge(df_clientes, df_pedidos, how="right", left_index=True, right_on="cliente_id")[["nombre"]]

                     nombre
pedido_id
101              Ana García
102           Luis Martínez
103              Ana García
104        Carlos Rodríguez
105             María López
106           Luis Martínez
107              Ana García
108                     NaN
109        Carlos Rodríguez

In [138]:
# 14. SELECT nombre, email FROM clientes WHERE UPPER(nombre) LIKE '%A%' OR UPPER(email) LIKE '%GMAIL%'

result = df_clientes[
    df_clientes["nombre"].str.upper().str.contains("A") | 
    df_clientes["nombre"].str.upper().str.contains("GMAIL")
]

result[["nombre", "email"]]

                      nombre               email
cliente_id
1                 Ana García       ana@gmail.com
2              Luis Martínez    luis@empresa.com
3           Carlos Rodríguez  carlos@hotmail.com
4                María López     maria@gmail.com
6            Laura Fernández     laura@gmail.com
7              Sofia Ramirez   sofia@empresa.com

In [139]:
# 15. SELECT UPPER(nombre), LOWER(ciudad) FROM clientes

df_nuevo = pd.DataFrame({
    "nombre_upper": df_clientes["nombre"].str.upper(),
    "nombre_lower": df_clientes["ciudad"].str.lower() 
})

df_nuevo

                nombre_upper nombre_lower
cliente_id
1                 ANA GARCÍA       madrid
2              LUIS MARTÍNEZ    barcelona
3           CARLOS RODRÍGUEZ       madrid
4                MARÍA LÓPEZ     valencia
5              PEDRO SÁNCHEZ      sevilla
6            LAURA FERNÁNDEZ    barcelona
7              SOFIA RAMIREZ       bilbao

In [140]:
# 16. SELECT TO_CHAR(fecha_registro, 'YYYY-MM') as año_mes, TO_CHAR(fecha_registro, 'DD/MM/YYYY') as fecha FROM clientes

df_nuevo = pd.DataFrame({
    "año_mes": df_clientes["fecha_registro"].dt.strftime("%Y-%m"),
    "fecha": df_clientes["fecha_registro"].dt.strftime("%d/%m/%Y")
})
df_nuevo

            año_mes       fecha
cliente_id
1           2023-01  15/01/2023
2           2022-03  22/03/2022
3           2023-05  10/05/2023
4           2021-11  30/11/2021
5           2023-08  14/08/2023
6           2022-01  05/01/2022
7           2023-12  01/12/2023

In [148]:
# 17. SELECT ROUND(saldo, 0), FLOOR(saldo) FROM clientes;

df_nuevo = pd.DataFrame({
    "saldo_round": df_clientes["saldo"].round(0),
    "saldo_floor": np.floor(df_clientes["saldo"])
})

df_nuevo

            saldo_round  saldo_floor
cliente_id
1                1500.0       1500.0
2                 801.0        800.0
3                2200.0       2200.0
4                 950.0        950.0
5                3001.0       3000.0
6                1200.0       1200.0
7                 751.0        750.0

In [152]:
# 18. SELECT * FROM clientes WHERE ciudad IN ('Madrid', 'Barcelona')

df_clientes[df_clientes["ciudad"].isin(("Madrid", "Barcelona"))]

,nombre,email,ciudad,saldo,fecha_registro,categoria
cliente_id,,,,,,
1,Ana García,ana@gmail.com,Madrid,1500.50,2023-01-15,Premium
2,Luis Martínez,luis@empresa.com,Barcelona,800.75,2022-03-22,Standard
3,Carlos Rodríguez,carlos@hotmail.com,Madrid,2200.00,2023-05-10,Premium
6,Laura Fernández,laura@gmail.com,Barcelona,1200.40,2022-01-05,Standard

In [168]:
# 19. SELECT nombre FROM clientes c WHERE EXISTS (SELECT 1 FROM pedidos p WHERE p.cliente_id = c.cliente_id AND p.total > 400)

df_pedidos_filtrados = df_pedidos[df_pedidos["total"] > 400]
clientes_pedidos_grandes = df_pedidos_filtrados["cliente_id"].unique()


df_clientes[df_clientes.index.isin(clientes_pedidos_grandes)]["nombre"]

cliente_id
1          Ana García
2       Luis Martínez
3    Carlos Rodríguez
Name: nombre, dtype: object

In [181]:
# 20. SELECT nombre FROM clientes WHERE cliente_id NOT IN (SELECT cliente_id FROM pedidos)

id_clientes = df_pedidos["cliente_id"].unique()

mask = np.isin(df_clientes.index, id_clientes, invert=True)

df_clientes[mask]["nombre"]

cliente_id
5      Pedro Sánchez
6    Laura Fernández
7      Sofia Ramirez
Name: nombre, dtype: object